# Semester 1 Project Submission

## Elliot

In [ ]:
# Your code here - remember to use markdown cells for comments as well!

## Ian

In [2]:
import sqlite3 as sql
import pandas as pd

### Items to be Resolved:
- check for nulls in the sql database tables being used
    - See following cell for findings.
- resolve found nulls 
    - Rows where null can be excluded. This is due to size and number of entries in dataset tables.
- experiment with joins to get tables wanted
    - Joined movie_basics with movie_ratings. Tried further joins but they get very large, very quickly (even using inner joins).
- export joined tables to dataframe
    - Do you agree we should drop rows where there are no genres?
- determine how to best use data for analysis
____________

- persons % bunch of null values in birth_year, death_year, and in primary_profession
- writers % NONE ARE NULL
- directors % NONE ARE NULL
- known_for % NONE ARE NULL
- principals % NO NULLS IN CATEGORY
- movie_basics % missing data in genres, runtime_minutes
- movie_ratings % NONE ARE NULL
- movie_akas % NO TITLES ARE NULL

In [3]:
# creating connection to database
conn = sql.connect("databases/im.db")

In [4]:
# movie basics query stage 1
q = """
SELECT
    *
FROM
    movie_basics
/*where statement below reduces dataset from 146144 rows to 112233*/
WHERE
    runtime_minutes IS NOT NULL AND genres IS NOT NULL
;"""
pd.read_sql(q, conn)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
4,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
...,...,...,...,...,...,...
112228,tt9916160,Drømmeland,Drømmeland,2019,72.0,Documentary
112229,tt9916170,The Rehearsal,O Ensaio,2019,51.0,Drama
112230,tt9916186,Illenau - die Geschichte einer ehemaligen Heil...,Illenau - die Geschichte einer ehemaligen Heil...,2017,84.0,Documentary
112231,tt9916190,Safeguard,Safeguard,2019,90.0,"Drama,Thriller"
112232,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama

In [24]:
# test to see how many values of each genre there are
q = """
SELECT
    *
FROM
    movie_basics
/*where statement below reduces dataset from 146144 rows to 112233*/
WHERE
    runtime_minutes IS NOT NULL AND genres IS NOT NULL
;"""
test2_df = pd.read_sql(q, conn)
test2_df.value_counts('genres')

genres
Documentary                   24672
Drama                         15725
Comedy                         6413
Comedy,Drama                   3163
Horror                         2975
                              ...
Documentary,Fantasy,Sci-Fi        1
History,News,War                  1
Adventure,Animation,Crime         1
Drama,Mystery,Sport               1
Adventure,History,Music           1
Length: 1040, dtype: int64

In [5]:
# movie ratings query stage 1
q = """
SELECT
    *
FROM
    movie_ratings
/*where statement below reduces dataset from 73856 rows to 73856 NO NULLS*/
WHERE
    averagerating IS NOT NULL AND numvotes IS NOT NULL
;"""
pd.read_sql(q, conn)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [6]:
# movie_akas query stage 1
q = """
SELECT
    *
FROM
    movie_akas
/*where statement below reduces dataset from 331703 rows to 331703 NO NULLS*/
WHERE
    title IS NOT NULL
;"""
pd.read_sql(q, conn)

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

In [7]:
# persons table query stage 1
q = """
SELECT
    *
FROM
    persons
WHERE
    primary_profession IS NULL
;"""
pd.read_sql(q, conn)

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0120366,Ralph Bunche,1904.0,1971.0,None
1,nm0256636,Emperor Franz Josef,1830.0,1916.0,None
2,nm0278661,Renee Firestone,NaN,NaN,None
3,nm0441808,Mike Katz,1944.0,NaN,None
4,nm0688002,Norman Podhoretz,1930.0,NaN,None
...,...,...,...,...,...
51335,nm9964778,Brian Espitia,NaN,NaN,None
51336,nm9967439,Jade Doucette,NaN,NaN,None
51337,nm9969939,Anna Bligh,NaN,NaN,None
51338,nm9976388,Naomie Monplaisir,NaN,NaN,None
51339,nm9990296,Fleurette Dicaire,NaN,NaN,None

In [8]:
# principals exploration query
q = """
SELECT
    *
FROM
    principals
;"""
pd.read_sql(q, conn)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [17]:
# principals category query
q = """
SELECT
    movie_id, person_id, category
FROM
    principals
;"""
test1_df = pd.read_sql(q, conn)
test1_df.value_counts('category')

category
actor                  256718
director               146393
actress                146208
producer               113724
cinematographer         80091
composer                77063
writer                  74357
self                    65424
editor                  55512
production_designer      9373
archive_footage          3307
archive_sound              16
dtype: int64

In [10]:
# directors exploration query
q = """
SELECT
    *
FROM
    directors
;"""
pd.read_sql(q, conn)

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]

In [11]:
# known_for exploration query
q = """
SELECT
    *
FROM
    known_for
;"""
pd.read_sql(q, conn)

         person_id   movie_id
0        nm0061671  tt0837562
1        nm0061671  tt2398241
2        nm0061671  tt0844471
3        nm0061671  tt0118553
4        nm0061865  tt0896534
...            ...        ...
1638255  nm9990690  tt9090932
1638256  nm9990690  tt8737130
1638257  nm9991320  tt8734436
1638258  nm9991320  tt9615610
1638259  nm9993380  tt8743182

[1638260 rows x 2 columns]

______________________________

### Consolidation Queries
- Tentative Scale:
    - 6 = good, 7 = great, 8 = wonderful, 9 = nearly perfect, 10 = masterpiece

In [87]:
# combining movie basics and movie ratings
q = """
SELECT
    mb.primary_title
    ,mb.runtime_minutes
    ,mb.genres
    ,mr.averagerating AS AverageRating
    ,mr.numvotes AS Num_Votes
FROM
    movie_basics AS mb
    JOIN movie_ratings AS mr
        USING(movie_id)
WHERE
    CAST(AverageRating AS float) > 6
    AND CAST(Num_Votes AS int) > 30
    AND mb.runtime_minutes IS NOT NULL
ORDER BY
    mr.averagerating DESC
;"""
pd.read_sql(q, conn)
# added in a filter that would filter out rows that have less than 30 votes

,primary_title,runtime_minutes,genres,AverageRating,Num_Votes
0,Gini Helida Kathe,138.0,Drama,9.9,417
1,RISE: The Story of Augustines,80.0,"Documentary,Music",9.8,45
2,My Darling Son,61.0,Documentary,9.7,32
3,MANRY AT SEA ~ In the Wake of a Dream,94.0,Documentary,9.7,48
4,DOSED,82.0,Documentary,9.7,72
...,...,...,...,...,...
22824,The Vancouver Asahi,132.0,Drama,6.1,196
22825,Belzebuth,114.0,Horror,6.1,288
22826,The Drug King,139.0,"Action,Crime,Drama",6.1,967
22827,One,148.0,"Drama,Thriller",6.1,175
22828,Chacun pour tous,94.0,Comedy,6.1,135

In [80]:
# combining movie basics and movie ratings
q = """
SELECT
    mb.primary_title, mb.runtime_minutes, mb.genres, mr.averagerating
FROM
    movie_basics AS mb
    JOIN movie_ratings AS mr
        USING(movie_id)
WHERE
    CAST(averagerating AS float) == 10
    AND runtime_minutes IS NOT NULL
ORDER BY
    mr.averagerating DESC
;"""
# checking to see titles with a rating of 10.0
# update to above comment: restricting num_votes by 30 (like above) will
test3_df = pd.read_sql(q, conn)
test3_df

,primary_title,runtime_minutes,genres,averagerating
0,Exteriores: Mulheres Brasileiras na Diplomacia,52.0,Documentary,10.0
1,The Dark Knight: The Ballad of the N Word,129.0,"Comedy,Drama",10.0
2,Freeing Bernie Baran,100.0,"Crime,Documentary",10.0
3,Hercule contre Hermès,72.0,Documentary,10.0
4,I Was Born Yesterday!,31.0,Documentary,10.0
5,Revolution Food,70.0,Documentary,10.0
6,Fly High: Story of the Disc Dog,65.0,Documentary,10.0
7,The Paternal Bond: Barbary Macaques,59.0,Documentary,10.0
8,Requiem voor een Boom,48.0,Documentary,10.0
9,A Dedicated Life: Phoebe Brand Beyond the Group,93.0,Documentary,10.0
10,Ellis Island: The Making of a Master Race in A...,70.0,"Documentary,History",10.0
11,Calamity Kevin,77.0,"Adventure,Comedy",10.0
12,Pick It Up! - Ska in the '90s,99.0,Documentary,10.0

In [88]:
# persons to principals to movie table
q = """
SELECT 
    pe.person_id
    ,pe.primary_name
    ,AVG(mr.averagerating) AS AverageRating
    ,COUNT(mb.primary_title) AS Num_of_Appearances
FROM
    persons AS pe
    JOIN principals AS pr
        USING(person_id)
    JOIN movie_basics AS mb
        USING(movie_id)
    JOIN movie_ratings as mr
        USING(movie_id)
GROUP BY
    pe.primary_name
ORDER BY
    Num_of_Appearances DESC
LIMIT 10
;"""
pd.read_sql(q, conn)

   person_id                  primary_name  AverageRating  Num_of_Appearances
0  nm1930572                 Kevin MacLeod       6.337427                 171
1  nm0000616                  Eric Roberts       4.823770                 122
2  nm0000636           William Shakespeare       7.116364                 110
3  nm2065631                   Gopi Sundar       5.929897                  97
4  nm0215842    Vicente G. del Rosario III       6.278481                  79
5  nm3888981                     S. Thaman       5.615789                  76
6  nm0695177                   Prakash Raj       5.983784                  74
7  nm0103977                  Brahmanandam       5.650000                  74
8  nm0215861  Veronique del Rosario-Corpus       6.246575                  73
9  nm0089658                    Jason Blum       5.839437                  71

In [89]:
# finding the average ratings per film and num of appearances for writers
q = """
SELECT 
    pe.person_id
    ,pr.category
    ,pe.primary_name
    ,AVG(mr.averagerating) AS AverageRating
    ,COUNT(mb.primary_title) AS Num_of_Appearances
FROM
    persons AS pe
    JOIN principals AS pr
        USING(person_id)
    JOIN movie_basics AS mb
        USING(movie_id)
    JOIN movie_ratings as mr
        USING(movie_id)
WHERE
    pr.category = 'writer'
GROUP BY
    pe.primary_name
ORDER BY
    Num_of_Appearances DESC
LIMIT 10
;"""
pd.read_sql(q, conn)

   person_id category         primary_name  AverageRating  Num_of_Appearances
0  nm0000636   writer  William Shakespeare       7.116364                 110
1  nm0893128   writer          Kona Venkat       5.943750                  32
2  nm0598531   writer          Mark Monroe       7.380645                  31
3  nm3057599   writer       Dheeraj Rattan       6.403333                  30
4  nm3015321   writer           Alim Sudio       6.356667                  30
5  nm1907447   writer     Titien Wattimena       7.316000                  25
6  nm3374598   writer  Padmanabha Dasgupta       6.360000                  25
7  nm3370087   writer           N.K. Salil       5.663636                  22
8  nm5055462   writer           L.G. Bayão       5.750000                  22
9  nm4683293   writer  Abdullah Zahir Babu       5.954545                  22

In [90]:
# finding the average ratings per film and num of appearances for directors
q = """
SELECT 
    pe.person_id
    ,pr.category
    ,pe.primary_name
    ,AVG(mr.averagerating) AS AverageRating
    ,COUNT(mb.primary_title) AS Num_of_Appearances
FROM
    persons AS pe
    JOIN principals AS pr
        USING(person_id)
    JOIN movie_basics AS mb
        USING(movie_id)
    JOIN movie_ratings as mr
        USING(movie_id)
WHERE
    pr.category = 'director'
GROUP BY
    pe.primary_name
ORDER BY
    Num_of_Appearances DESC
LIMIT 10
;"""
pd.read_sql(q, conn)

   person_id  category       primary_name  AverageRating  Num_of_Appearances
0  nm2551464  director   Nayato Fio Nuala       4.713514                  37
1  nm0213983  director     David DeCoteau       3.400000                  27
2  nm4341114  director    Dustin Ferguson       3.788462                  26
3  nm3583561  director        Larry Rosen       7.184000                  25
4  nm0559285  director    Rizal Mantovani       5.842857                  21
5  nm0890060  director    Ram Gopal Varma       5.738095                  21
6  nm1047180  director   William Winckler       7.080000                  20
7  nm0946875  director         Herman Yau       5.645000                  20
8  nm2538739  director   Hanung Bramantyo       6.745000                  20
9  nm1066739  director  Yukihiko Tsutsumi       6.389474                  19

In [93]:
# finding the average ratings per film and num of appearances for actor/actress
q = """
SELECT 
    pe.person_id
    ,pr.category
    ,pe.primary_name
    ,AVG(mr.averagerating) AS AverageRating
    ,COUNT(mb.primary_title) AS Num_of_Appearances
FROM
    persons AS pe
    JOIN principals AS pr
        USING(person_id)
    JOIN movie_basics AS mb
        USING(movie_id)
    JOIN movie_ratings as mr
        USING(movie_id)
WHERE
    pr.category IN ('actor', 'actress') AND CAST(AverageRating AS float) >= 6
GROUP BY
    pe.primary_name
HAVING
    Num_of_Appearances > 2
ORDER BY
    Num_of_Appearances DESC
;"""
# filtering for only actor/actresses who had an average rating of 6 or greater
pd.read_sql(q, conn)

,person_id,category,primary_name,AverageRating,Num_of_Appearances
0,nm0695177,actor,Prakash Raj,6.961905,42
1,nm5954636,actor,Sergey A.,7.458824,34
2,nm1384413,actor,Saswata Chatterjee,6.897059,34
3,nm2794335,actor,Sadhu Kokila,6.878125,32
4,nm0000616,actor,Eric Roberts,7.050000,32
...,...,...,...,...,...
8955,nm3810208,actor,Aarif Rahman,7.100000,3
8956,nm5615313,actor,Aari,6.733333,3
8957,nm3933547,actress,Aahana Kumra,6.466667,3
8958,nm4462167,actor,AJ Muhlach,7.433333,3
8959,nm0553436,actor,A Martinez,6.300000,3

In [92]:
# finding the average ratings per film and num of appearances for producer
# hard to quantify where to limit here regarding appearances -- producers often only produce once, apparently
q = """
SELECT 
    pe.person_id
    ,pr.category
    ,pe.primary_name
    ,AVG(mr.averagerating) AS AverageRating
    ,COUNT(mb.primary_title) AS Num_of_Appearances
FROM
    persons AS pe
    JOIN principals AS pr
        USING(person_id)
    JOIN movie_basics AS mb
        USING(movie_id)
    JOIN movie_ratings as mr
        USING(movie_id)
WHERE
    pr.category = 'producer' AND CAST(AverageRating AS float) >= 6
GROUP BY
    pe.primary_name
HAVING
    Num_of_Appearances > 1
ORDER BY
    AverageRating DESC
;"""
pd.read_sql(q, conn)

,person_id,category,primary_name,AverageRating,Num_of_Appearances
0,nm7574932,producer,Stephanie Benamra,9.80,2
1,nm5641779,producer,Marvin Glover,9.30,2
2,nm1979830,producer,Marija Kosor,9.25,4
3,nm4813335,producer,Igor Jelinovic,9.25,2
4,nm4099687,producer,Tyler Marino,9.20,2
...,...,...,...,...,...
7727,nm2994729,producer,Didier Costet,6.00,2
7728,nm3450764,producer,David Mimran,6.00,3
7729,nm2820211,producer,Christophe Barral,6.00,2
7730,nm2208460,producer,Atsushi Moriyama,6.00,3
7731,nm1672378,producer,Aleksey Kublitskiy,6.00,2

## Frida

In [ ]:
# Your code here - remember to use markdown cells for comments as well!

## Enrique

In [ ]:
# Your code here - remember to use markdown cells for comments as well!

## John

In [ ]:
# Your code here - remember to use markdown cells for comments as well!